Revit 2027 API
ImagePlacementOptions.Location Property
 The location in the model where a point of the ImageInstance, determined by the PlacementPoint property, is going to be inserted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Location { get; set; }
Public Property Location As XYZ
	Get
	Set
public:
property XYZ^ Location {
	XYZ^ get ();
	void set (XYZ^ value);
}
member Location : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The location represents a point in the model where the ImageInstance will be placed. The location of the image in the view is determined by the projection of this point onto the plane of the view. This means that in a plan view, for example, the z-coordinate has no effect.
See Also
Reference
ImagePlacementOptions Class
Autodesk.Revit.DB Namespace